## Review of containers(set and items)

### [] list
### () tuple
### {} dictionary or set

In [2]:
{3,4,5,6,7,8,9}

{3, 4, 5, 6, 7, 8, 9}

In [3]:
(3,4,5,6,7,8,9)

(3, 4, 5, 6, 7, 8, 9)

In [4]:
[3,4,5,6,7,8,9]

[3, 4, 5, 6, 7, 8, 9]

In [5]:
setA={3,4,5,6,7,8,9}
setB={2,3,4,5,6,6}

In [6]:
setA

{3, 4, 5, 6, 7, 8, 9}

In [7]:
setB

{2, 3, 4, 5, 6}

In [8]:
setA.intersection(setB)

{3, 4, 5, 6}

In [9]:
setA & setB

{3, 4, 5, 6}

In [10]:
setA.union(setB)

{2, 3, 4, 5, 6, 7, 8, 9}

In [11]:
setA | setB

{2, 3, 4, 5, 6, 7, 8, 9}

In [12]:
setA.difference(setB)

{7, 8, 9}

In [13]:
setB.difference(setA)

{2}

In [14]:
setA.symmetric_difference(setB)

{2, 7, 8, 9}

In [15]:
props={"name":"Smith","age":24,"gender":"Male"}

In [16]:
props

{'name': 'Smith', 'age': 24, 'gender': 'Male'}

In [17]:
props["name"]

'Smith'

In [18]:
props["age"]

24

In [19]:
props["age"]=30 ## augumented assignment statement

In [20]:
props

{'name': 'Smith', 'age': 30, 'gender': 'Male'}

In [21]:
props.keys()

dict_keys(['name', 'age', 'gender'])

In [22]:
props.values()

dict_values(['Smith', 30, 'Male'])

In [23]:
props.items()

dict_items([('name', 'Smith'), ('age', 30), ('gender', 'Male')])

In [24]:
props.items()

dict_items([('name', 'Smith'), ('age', 30), ('gender', 'Male')])

In [25]:
import pandas as pd

In [26]:
df=pd.read_csv("train.csv")

In [27]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Data cleaning or munging

In [28]:
df.drop(["Ticket"],axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,NaN,Q

In [29]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [30]:
df.drop(["Ticket"],axis=1,inplace=True)

In [31]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,NaN,S

### Handling missing dada(data imputation)

* Fill
    * by value
    * by method
* Drop
    * row
    * columns

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [33]:
df1=df.drop(["Age","Embarked","Cabin"], axis=1)

In [34]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,8.0500

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
dtypes: float64(1), int64(5), object(2)
memory usage: 55.8+ KB

In [36]:
df2=df.dropna(axis=1)

In [37]:
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,8.0500

In [38]:
df3=df.dropna() ## The row was not specified because by default,it sepcifies the row whoch is axis=o

In [40]:
df3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,C103,S

In [41]:
df3.shape

(183, 11)

In [42]:
df.shape

(891, 11)